{"patient_id": "P016", "note": "Male patient, aged 52, presented for evaluation of persistent fatigue and generalized joint pain ongoing for ~3 months. Reports no recent infections, but complains of occasional low-grade fevers and unintentional weight loss (~5kg). Denies rash, oral ulcers, or photosensitivity. Physical exam unremarkable except for tenderness in small joints of both hands. ANA test positive (1:160, speckled). ESR elevated. Rheumatology referral made. Probable early connective tissue disease (SLE vs RA). Initiated Naproxen for symptom relief. Patient advised to monitor for new symptoms and return in 2 weeks."}
{"patient_id": "P017", "note": "Consult note: Mrs. A., 78 y/o, admitted 08/03/25 following a syncopal episode at home. No head trauma. No seizure-like activity. PMH: HTN, atrial fibrillation (on apixaban), CKD stage III. Initial ECG: bradycardia at 42 bpm. CT head: no acute pathology. Cardiology consulted — pacemaker placement advised after telemetry revealed sinus pauses >4 sec. Patient and family informed. Anticoagulation paused pre-op. Consent obtained. Awaiting OR slot."}
{"patient_id": "P018", "note": "Telemedicine visit. Pt: 33 y/o female with hx of GAD, reports return of panic attacks 3x/week, often nocturnal. Describes palpitations, chest tightness, and fear of dying. No suicidal ideation. Currently on sertraline 50mg/day. No recent dosage changes. Discussed CBT, relaxation techniques. Increased sertraline to 75mg. Provided crisis line info. F/u via video in 10 days."}
{"patient_id": "P019", "note": "Mr. R.D., 61M, truck driver, evaluated for chronic lower back pain (>1 year), worse with prolonged sitting/driving. No red flag signs. MRI lumbosacral spine from April reviewed — reveals mild degenerative disc disease at L4-L5 with no significant nerve impingement. NSAIDs minimally effective. Referral to physiatry made. Will trial structured PT program 2x/week for 6 weeks. Discussion held about weight reduction (BMI 33) and posture correction. No opioids indicated at this time."}
{"patient_id": "P020", "note": "- Pt: 19 y/o M\n- Chief complaint: fever, sore throat, fatigue x5 days\n- Exam: temp 38.5°C, posterior cervical lymphadenopathy, tonsillar exudates\n- Rapid strep: negative; Monospot: positive\n- Dx: Infectious Mononucleosis\n- Tx: supportive care only; avoid contact sports (splenomegaly risk)\n- No antibiotics prescribed\n- Education: hydration, rest; f/u PRN"}
{"patient_id": "P021", "note": "Emily R., 41, visited clinic today for follow-up on gestational diabetes (GDM). Currently 30 weeks pregnant. Glucose readings reviewed: fasting avg ~100, postprandial ~140–150. On diet control + nighttime insulin 10u. No hypoglycemic events. Fetal movements normal. BP 126/84. Fundal height appropriate. Advised to increase insulin to 12u. Dietitian follow-up arranged. Next OB visit: 1 week."}
{"patient_id": "P022", "note": "Elderly patient, 85F, found by caregiver to be increasingly confused and lethargic. PMH includes dementia, HTN, CHF. Vitals: afebrile, BP 104/66, HR 92. Labs: Na 127, BUN 31, Cr 1.4 (baseline 1.1). UTI suspected (cloudy urine, strong odor). UA shows leukocytes, nitrites. Started empirically on PO Nitrofurantoin. Encouraged oral fluids. Hold diuretics temporarily. Will reassess in 48h."}
{"patient_id": "P023", "note": "36-year-old trans male (FTM) presented for routine hormone therapy monitoring. On testosterone cypionate IM 100mg weekly. Last dose: 4 days ago. Labs: Hgb 17.2, Hct 50.3%, T level 683 ng/dL (drawn mid-cycle). BP: 122/76. Mood and energy levels reported as stable. No acne or hair loss. Advised to maintain current dosing. Annual pelvic US scheduled due to persistent spotting. Safe sex discussed, PrEP not indicated (monogamous relationship). Next visit: 3 months."}
